docs/benchmark/results/lumen/ramp-up_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/a1/develop/lumen-gateway/docs/benchmark/k6/ramp-up.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 3m0s max duration (incl. graceful stop):
              * ramp: Up to 500 looping VUs for 2m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 003/500 VUs, 2815 complete and 0 interrupted iterations
ramp   [   1% ] 003/500 VUs  0m01.0s/2m30.0s

running (0m02.0s), 006/500 VUs, 12161 complete and 0 interrupted iterations
ramp   [   1% ] 006/500 VUs  0m02.0s/2m30.0s

running (0m03.0s), 009/500 VUs, 23950 complete and 0 interrupted iterations
ramp   [   2% ] 009/500 VUs  0m03.0s/2m30.0s

running (0m04.0s), 013/500 VUs, 37792 complete and 0 interrupted iterations
ramp   [   3% ] 013/500 VUs  0m04.0s/2m30.0s

running (0m05.0s), 016/500 VUs, 53145 complete and 0 interrupted iterations
ramp   [   3% ] 016/500 VUs  0m05.0s/2m30.0s

running (0m06.0s), 019/500 VUs, 68674 complete and 0 interrupted iterations
ramp   [   4% ] 019/500 VUs  0m06.0s/2m30.0s

running (0m07.0s), 023/500 VUs, 84165 complete and 0 interrupted iterations
ramp   [   5% ] 023/500 VUs  0m07.0s/2m30.0s

running (0m08.0s), 026/500 VUs, 99736 complete and 0 interrupted iterations
ramp   [   5% ] 026/500 VUs  0m08.0s/2m30.0s

running (0m09.0s), 029/500 VUs, 116792 complete and 0 interrupted iterations
ramp   [   6% ] 029/500 VUs  0m09.0s/2m30.0s

running (0m10.0s), 033/500 VUs, 133834 complete and 0 interrupted iterations
ramp   [   7% ] 033/500 VUs  0m10.0s/2m30.0s

running (0m11.0s), 036/500 VUs, 151312 complete and 0 interrupted iterations
ramp   [   7% ] 036/500 VUs  0m11.0s/2m30.0s

running (0m12.0s), 039/500 VUs, 169107 complete and 0 interrupted iterations
ramp   [   8% ] 039/500 VUs  0m12.0s/2m30.0s

running (0m13.0s), 043/500 VUs, 186464 complete and 0 interrupted iterations
ramp   [   9% ] 043/500 VUs  0m13.0s/2m30.0s

running (0m14.0s), 046/500 VUs, 204423 complete and 0 interrupted iterations
ramp   [   9% ] 046/500 VUs  0m14.0s/2m30.0s

running (0m15.0s), 049/500 VUs, 221611 complete and 0 interrupted iterations
ramp   [  10% ] 049/500 VUs  0m15.0s/2m30.0s

running (0m16.0s), 053/500 VUs, 239690 complete and 0 interrupted iterations
ramp   [  11% ] 053/500 VUs  0m16.0s/2m30.0s

running (0m17.0s), 056/500 VUs, 258232 complete and 0 interrupted iterations
ramp   [  11% ] 056/500 VUs  0m17.0s/2m30.0s

running (0m18.0s), 059/500 VUs, 275899 complete and 0 interrupted iterations
ramp   [  12% ] 059/500 VUs  0m18.0s/2m30.0s

running (0m19.0s), 063/500 VUs, 294468 complete and 0 interrupted iterations
ramp   [  13% ] 063/500 VUs  0m19.0s/2m30.0s

running (0m20.0s), 066/500 VUs, 312535 complete and 0 interrupted iterations
ramp   [  13% ] 066/500 VUs  0m20.0s/2m30.0s

running (0m21.0s), 069/500 VUs, 330355 complete and 0 interrupted iterations
ramp   [  14% ] 069/500 VUs  0m21.0s/2m30.0s

running (0m22.0s), 073/500 VUs, 350193 complete and 0 interrupted iterations
ramp   [  15% ] 073/500 VUs  0m22.0s/2m30.0s

running (0m23.0s), 076/500 VUs, 367340 complete and 0 interrupted iterations
ramp   [  15% ] 076/500 VUs  0m23.0s/2m30.0s

running (0m24.0s), 079/500 VUs, 385562 complete and 0 interrupted iterations
ramp   [  16% ] 079/500 VUs  0m24.0s/2m30.0s

running (0m25.0s), 083/500 VUs, 404829 complete and 0 interrupted iterations
ramp   [  17% ] 083/500 VUs  0m25.0s/2m30.0s

running (0m26.0s), 086/500 VUs, 423642 complete and 0 interrupted iterations
ramp   [  17% ] 086/500 VUs  0m26.0s/2m30.0s

running (0m27.0s), 089/500 VUs, 442539 complete and 0 interrupted iterations
ramp   [  18% ] 089/500 VUs  0m27.0s/2m30.0s

running (0m28.0s), 093/500 VUs, 462411 complete and 0 interrupted iterations
ramp   [  19% ] 093/500 VUs  0m28.0s/2m30.0s

running (0m29.0s), 096/500 VUs, 482255 complete and 0 interrupted iterations
ramp   [  19% ] 096/500 VUs  0m29.0s/2m30.0s

running (0m30.0s), 099/500 VUs, 501806 complete and 0 interrupted iterations
ramp   [  20% ] 099/500 VUs  0m30.0s/2m30.0s

running (0m31.0s), 106/500 VUs, 521265 complete and 0 interrupted iterations
ramp   [  21% ] 106/500 VUs  0m31.0s/2m30.0s

running (0m32.0s), 113/500 VUs, 539637 complete and 0 interrupted iterations
ramp   [  21% ] 113/500 VUs  0m32.0s/2m30.0s

running (0m33.0s), 119/500 VUs, 559485 complete and 0 interrupted iterations
ramp   [  22% ] 119/500 VUs  0m33.0s/2m30.0s

running (0m34.0s), 126/500 VUs, 581188 complete and 0 interrupted iterations
ramp   [  23% ] 126/500 VUs  0m34.0s/2m30.0s

running (0m35.0s), 133/500 VUs, 600752 complete and 0 interrupted iterations
ramp   [  23% ] 133/500 VUs  0m35.0s/2m30.0s

running (0m36.0s), 139/500 VUs, 620034 complete and 0 interrupted iterations
ramp   [  24% ] 139/500 VUs  0m36.0s/2m30.0s

running (0m37.0s), 146/500 VUs, 642425 complete and 0 interrupted iterations
ramp   [  25% ] 146/500 VUs  0m37.0s/2m30.0s

running (0m38.0s), 153/500 VUs, 662221 complete and 0 interrupted iterations
ramp   [  25% ] 153/500 VUs  0m38.0s/2m30.0s

running (0m39.0s), 159/500 VUs, 682498 complete and 0 interrupted iterations
ramp   [  26% ] 159/500 VUs  0m39.0s/2m30.0s

running (0m40.0s), 166/500 VUs, 704091 complete and 0 interrupted iterations
ramp   [  27% ] 166/500 VUs  0m40.0s/2m30.0s

running (0m41.0s), 173/500 VUs, 725445 complete and 0 interrupted iterations
ramp   [  27% ] 173/500 VUs  0m41.0s/2m30.0s

running (0m42.0s), 179/500 VUs, 748269 complete and 0 interrupted iterations
ramp   [  28% ] 179/500 VUs  0m42.0s/2m30.0s

running (0m43.0s), 186/500 VUs, 768844 complete and 0 interrupted iterations
ramp   [  29% ] 186/500 VUs  0m43.0s/2m30.0s

running (0m44.0s), 193/500 VUs, 791145 complete and 0 interrupted iterations
ramp   [  29% ] 193/500 VUs  0m44.0s/2m30.0s

running (0m45.0s), 199/500 VUs, 812078 complete and 0 interrupted iterations
ramp   [  30% ] 199/500 VUs  0m45.0s/2m30.0s

running (0m46.0s), 206/500 VUs, 833526 complete and 0 interrupted iterations
ramp   [  31% ] 206/500 VUs  0m46.0s/2m30.0s

running (0m47.0s), 213/500 VUs, 853518 complete and 0 interrupted iterations
ramp   [  31% ] 213/500 VUs  0m47.0s/2m30.0s

running (0m48.0s), 219/500 VUs, 874294 complete and 0 interrupted iterations
ramp   [  32% ] 219/500 VUs  0m48.0s/2m30.0s

running (0m49.0s), 226/500 VUs, 895668 complete and 0 interrupted iterations
ramp   [  33% ] 226/500 VUs  0m49.0s/2m30.0s

running (0m50.0s), 233/500 VUs, 913924 complete and 0 interrupted iterations
ramp   [  33% ] 233/500 VUs  0m50.0s/2m30.0s

running (0m51.0s), 239/500 VUs, 935543 complete and 0 interrupted iterations
ramp   [  34% ] 239/500 VUs  0m51.0s/2m30.0s

running (0m52.0s), 246/500 VUs, 958361 complete and 0 interrupted iterations
ramp   [  35% ] 246/500 VUs  0m52.0s/2m30.0s

running (0m53.0s), 253/500 VUs, 979836 complete and 0 interrupted iterations
ramp   [  35% ] 253/500 VUs  0m53.0s/2m30.0s

running (0m54.0s), 259/500 VUs, 1002321 complete and 0 interrupted iterations
ramp   [  36% ] 259/500 VUs  0m54.0s/2m30.0s

running (0m55.0s), 266/500 VUs, 1025036 complete and 0 interrupted iterations
ramp   [  37% ] 266/500 VUs  0m55.0s/2m30.0s

running (0m56.0s), 273/500 VUs, 1048241 complete and 0 interrupted iterations
ramp   [  37% ] 273/500 VUs  0m56.0s/2m30.0s

running (0m57.0s), 279/500 VUs, 1070323 complete and 0 interrupted iterations
ramp   [  38% ] 279/500 VUs  0m57.0s/2m30.0s

running (0m58.0s), 286/500 VUs, 1092351 complete and 0 interrupted iterations
ramp   [  39% ] 286/500 VUs  0m58.0s/2m30.0s

running (0m59.0s), 293/500 VUs, 1115187 complete and 0 interrupted iterations
ramp   [  39% ] 293/500 VUs  0m59.0s/2m30.0s

running (1m00.0s), 299/500 VUs, 1136555 complete and 0 interrupted iterations
ramp   [  40% ] 299/500 VUs  1m00.0s/2m30.0s

running (1m01.0s), 306/500 VUs, 1159624 complete and 0 interrupted iterations
ramp   [  41% ] 306/500 VUs  1m01.0s/2m30.0s

running (1m02.0s), 313/500 VUs, 1183269 complete and 0 interrupted iterations
ramp   [  41% ] 313/500 VUs  1m02.0s/2m30.0s

running (1m03.0s), 319/500 VUs, 1206745 complete and 0 interrupted iterations
ramp   [  42% ] 319/500 VUs  1m03.0s/2m30.0s

running (1m04.0s), 326/500 VUs, 1228073 complete and 0 interrupted iterations
ramp   [  43% ] 326/500 VUs  1m04.0s/2m30.0s

running (1m05.0s), 333/500 VUs, 1249541 complete and 0 interrupted iterations
ramp   [  43% ] 333/500 VUs  1m05.0s/2m30.0s

running (1m06.0s), 339/500 VUs, 1272761 complete and 0 interrupted iterations
ramp   [  44% ] 339/500 VUs  1m06.0s/2m30.0s

running (1m07.0s), 346/500 VUs, 1294400 complete and 0 interrupted iterations
ramp   [  45% ] 346/500 VUs  1m07.0s/2m30.0s

running (1m08.0s), 353/500 VUs, 1313172 complete and 0 interrupted iterations
ramp   [  45% ] 353/500 VUs  1m08.0s/2m30.0s

running (1m09.0s), 359/500 VUs, 1337107 complete and 0 interrupted iterations
ramp   [  46% ] 359/500 VUs  1m09.0s/2m30.0s

running (1m10.0s), 366/500 VUs, 1356293 complete and 0 interrupted iterations
ramp   [  47% ] 366/500 VUs  1m10.0s/2m30.0s

running (1m11.0s), 373/500 VUs, 1380991 complete and 0 interrupted iterations
ramp   [  47% ] 373/500 VUs  1m11.0s/2m30.0s

running (1m12.0s), 379/500 VUs, 1402935 complete and 0 interrupted iterations
ramp   [  48% ] 379/500 VUs  1m12.0s/2m30.0s

running (1m13.0s), 386/500 VUs, 1422246 complete and 0 interrupted iterations
ramp   [  49% ] 386/500 VUs  1m13.0s/2m30.0s

running (1m14.0s), 393/500 VUs, 1443314 complete and 0 interrupted iterations
ramp   [  49% ] 393/500 VUs  1m14.0s/2m30.0s

running (1m15.0s), 399/500 VUs, 1467184 complete and 0 interrupted iterations
ramp   [  50% ] 399/500 VUs  1m15.0s/2m30.0s

running (1m16.0s), 406/500 VUs, 1491832 complete and 0 interrupted iterations
ramp   [  51% ] 406/500 VUs  1m16.0s/2m30.0s

running (1m17.0s), 413/500 VUs, 1512522 complete and 0 interrupted iterations
ramp   [  51% ] 413/500 VUs  1m17.0s/2m30.0s

running (1m18.0s), 419/500 VUs, 1536453 complete and 0 interrupted iterations
ramp   [  52% ] 419/500 VUs  1m18.0s/2m30.0s

running (1m19.0s), 426/500 VUs, 1557395 complete and 0 interrupted iterations
ramp   [  53% ] 426/500 VUs  1m19.0s/2m30.0s

running (1m20.0s), 433/500 VUs, 1580436 complete and 0 interrupted iterations
ramp   [  53% ] 433/500 VUs  1m20.0s/2m30.0s

running (1m21.0s), 439/500 VUs, 1604767 complete and 0 interrupted iterations
ramp   [  54% ] 439/500 VUs  1m21.0s/2m30.0s

running (1m22.0s), 446/500 VUs, 1624035 complete and 0 interrupted iterations
ramp   [  55% ] 446/500 VUs  1m22.0s/2m30.0s

running (1m23.0s), 453/500 VUs, 1644703 complete and 0 interrupted iterations
ramp   [  55% ] 453/500 VUs  1m23.0s/2m30.0s

running (1m24.0s), 459/500 VUs, 1666709 complete and 0 interrupted iterations
ramp   [  56% ] 459/500 VUs  1m24.0s/2m30.0s

running (1m25.0s), 466/500 VUs, 1688626 complete and 0 interrupted iterations
ramp   [  57% ] 466/500 VUs  1m25.0s/2m30.0s

running (1m26.0s), 473/500 VUs, 1713074 complete and 0 interrupted iterations
ramp   [  57% ] 473/500 VUs  1m26.0s/2m30.0s

running (1m27.0s), 479/500 VUs, 1735376 complete and 0 interrupted iterations
ramp   [  58% ] 479/500 VUs  1m27.0s/2m30.0s

running (1m28.0s), 486/500 VUs, 1759812 complete and 0 interrupted iterations
ramp   [  59% ] 486/500 VUs  1m28.0s/2m30.0s

running (1m29.0s), 493/500 VUs, 1785056 complete and 0 interrupted iterations
ramp   [  59% ] 493/500 VUs  1m29.0s/2m30.0s

running (1m30.0s), 499/500 VUs, 1808757 complete and 0 interrupted iterations
ramp   [  60% ] 499/500 VUs  1m30.0s/2m30.0s

running (1m31.0s), 500/500 VUs, 1832489 complete and 0 interrupted iterations
ramp   [  61% ] 500/500 VUs  1m31.0s/2m30.0s

running (1m32.0s), 500/500 VUs, 1855579 complete and 0 interrupted iterations
ramp   [  61% ] 500/500 VUs  1m32.0s/2m30.0s

running (1m33.0s), 500/500 VUs, 1875619 complete and 0 interrupted iterations
ramp   [  62% ] 500/500 VUs  1m33.0s/2m30.0s

running (1m34.0s), 500/500 VUs, 1899619 complete and 0 interrupted iterations
ramp   [  63% ] 500/500 VUs  1m34.0s/2m30.0s

running (1m35.0s), 500/500 VUs, 1920157 complete and 0 interrupted iterations
ramp   [  63% ] 500/500 VUs  1m35.0s/2m30.0s

running (1m36.0s), 500/500 VUs, 1940213 complete and 0 interrupted iterations
ramp   [  64% ] 500/500 VUs  1m36.0s/2m30.0s

running (1m37.0s), 500/500 VUs, 1962048 complete and 0 interrupted iterations
ramp   [  65% ] 500/500 VUs  1m37.0s/2m30.0s

running (1m38.0s), 500/500 VUs, 1986160 complete and 0 interrupted iterations
ramp   [  65% ] 500/500 VUs  1m38.0s/2m30.0s

running (1m39.0s), 500/500 VUs, 2008129 complete and 0 interrupted iterations
ramp   [  66% ] 500/500 VUs  1m39.0s/2m30.0s

running (1m40.0s), 500/500 VUs, 2030756 complete and 0 interrupted iterations
ramp   [  67% ] 500/500 VUs  1m40.0s/2m30.0s

running (1m41.0s), 500/500 VUs, 2055283 complete and 0 interrupted iterations
ramp   [  67% ] 500/500 VUs  1m41.0s/2m30.0s

running (1m42.0s), 500/500 VUs, 2078408 complete and 0 interrupted iterations
ramp   [  68% ] 500/500 VUs  1m42.0s/2m30.0s

running (1m43.0s), 500/500 VUs, 2101998 complete and 0 interrupted iterations
ramp   [  69% ] 500/500 VUs  1m43.0s/2m30.0s

running (1m44.0s), 500/500 VUs, 2123410 complete and 0 interrupted iterations
ramp   [  69% ] 500/500 VUs  1m44.0s/2m30.0s

running (1m45.0s), 500/500 VUs, 2147596 complete and 0 interrupted iterations
ramp   [  70% ] 500/500 VUs  1m45.0s/2m30.0s

running (1m46.0s), 500/500 VUs, 2171236 complete and 0 interrupted iterations
ramp   [  71% ] 500/500 VUs  1m46.0s/2m30.0s

running (1m47.0s), 500/500 VUs, 2194688 complete and 0 interrupted iterations
ramp   [  71% ] 500/500 VUs  1m47.0s/2m30.0s

running (1m48.0s), 500/500 VUs, 2215434 complete and 0 interrupted iterations
ramp   [  72% ] 500/500 VUs  1m48.0s/2m30.0s

running (1m49.0s), 500/500 VUs, 2238299 complete and 0 interrupted iterations
ramp   [  73% ] 500/500 VUs  1m49.0s/2m30.0s

running (1m50.0s), 500/500 VUs, 2261669 complete and 0 interrupted iterations
ramp   [  73% ] 500/500 VUs  1m50.0s/2m30.0s

running (1m51.0s), 500/500 VUs, 2285258 complete and 0 interrupted iterations
ramp   [  74% ] 500/500 VUs  1m51.0s/2m30.0s

running (1m52.0s), 500/500 VUs, 2308255 complete and 0 interrupted iterations
ramp   [  75% ] 500/500 VUs  1m52.0s/2m30.0s

running (1m53.0s), 500/500 VUs, 2333066 complete and 0 interrupted iterations
ramp   [  75% ] 500/500 VUs  1m53.0s/2m30.0s

running (1m54.0s), 500/500 VUs, 2357670 complete and 0 interrupted iterations
ramp   [  76% ] 500/500 VUs  1m54.0s/2m30.0s

running (1m55.0s), 500/500 VUs, 2381784 complete and 0 interrupted iterations
ramp   [  77% ] 500/500 VUs  1m55.0s/2m30.0s

running (1m56.0s), 500/500 VUs, 2406358 complete and 0 interrupted iterations
ramp   [  77% ] 500/500 VUs  1m56.0s/2m30.0s

running (1m57.0s), 500/500 VUs, 2428725 complete and 0 interrupted iterations
ramp   [  78% ] 500/500 VUs  1m57.0s/2m30.0s

running (1m58.0s), 500/500 VUs, 2450895 complete and 0 interrupted iterations
ramp   [  79% ] 500/500 VUs  1m58.0s/2m30.0s

running (1m59.0s), 500/500 VUs, 2473740 complete and 0 interrupted iterations
ramp   [  79% ] 500/500 VUs  1m59.0s/2m30.0s

running (2m00.0s), 500/500 VUs, 2498129 complete and 0 interrupted iterations
ramp   [  80% ] 500/500 VUs  2m00.0s/2m30.0s

running (2m01.0s), 485/500 VUs, 2519610 complete and 0 interrupted iterations
ramp   [  81% ] 485/500 VUs  2m01.0s/2m30.0s

running (2m02.0s), 468/500 VUs, 2540575 complete and 0 interrupted iterations
ramp   [  81% ] 468/500 VUs  2m02.0s/2m30.0s

running (2m03.0s), 451/500 VUs, 2561722 complete and 0 interrupted iterations
ramp   [  82% ] 451/500 VUs  2m03.0s/2m30.0s

running (2m04.0s), 434/500 VUs, 2583950 complete and 0 interrupted iterations
ramp   [  83% ] 434/500 VUs  2m04.0s/2m30.0s

running (2m05.0s), 418/500 VUs, 2606358 complete and 0 interrupted iterations
ramp   [  83% ] 418/500 VUs  2m05.0s/2m30.0s

running (2m06.0s), 401/500 VUs, 2627644 complete and 0 interrupted iterations
ramp   [  84% ] 401/500 VUs  2m06.0s/2m30.0s

running (2m07.0s), 384/500 VUs, 2651004 complete and 0 interrupted iterations
ramp   [  85% ] 384/500 VUs  2m07.0s/2m30.0s

running (2m08.0s), 368/500 VUs, 2673487 complete and 0 interrupted iterations
ramp   [  85% ] 368/500 VUs  2m08.0s/2m30.0s

running (2m09.0s), 351/500 VUs, 2695483 complete and 0 interrupted iterations
ramp   [  86% ] 351/500 VUs  2m09.0s/2m30.0s

running (2m10.0s), 334/500 VUs, 2716679 complete and 0 interrupted iterations
ramp   [  87% ] 334/500 VUs  2m10.0s/2m30.0s

running (2m11.0s), 318/500 VUs, 2738734 complete and 0 interrupted iterations
ramp   [  87% ] 318/500 VUs  2m11.0s/2m30.0s

running (2m12.0s), 301/500 VUs, 2760513 complete and 0 interrupted iterations
ramp   [  88% ] 301/500 VUs  2m12.0s/2m30.0s

running (2m13.0s), 284/500 VUs, 2780849 complete and 0 interrupted iterations
ramp   [  89% ] 284/500 VUs  2m13.0s/2m30.0s

running (2m14.0s), 268/500 VUs, 2802889 complete and 0 interrupted iterations
ramp   [  89% ] 268/500 VUs  2m14.0s/2m30.0s

running (2m15.0s), 251/500 VUs, 2824751 complete and 0 interrupted iterations
ramp   [  90% ] 251/500 VUs  2m15.0s/2m30.0s

running (2m16.0s), 234/500 VUs, 2846208 complete and 0 interrupted iterations
ramp   [  91% ] 234/500 VUs  2m16.0s/2m30.0s

running (2m17.0s), 218/500 VUs, 2867798 complete and 0 interrupted iterations
ramp   [  91% ] 218/500 VUs  2m17.0s/2m30.0s

running (2m18.0s), 201/500 VUs, 2886492 complete and 0 interrupted iterations
ramp   [  92% ] 201/500 VUs  2m18.0s/2m30.0s

running (2m19.0s), 184/500 VUs, 2908485 complete and 0 interrupted iterations
ramp   [  93% ] 184/500 VUs  2m19.0s/2m30.0s

running (2m20.0s), 168/500 VUs, 2927357 complete and 0 interrupted iterations
ramp   [  93% ] 168/500 VUs  2m20.0s/2m30.0s

running (2m21.0s), 151/500 VUs, 2946749 complete and 0 interrupted iterations
ramp   [  94% ] 151/500 VUs  2m21.0s/2m30.0s

running (2m22.0s), 134/500 VUs, 2965586 complete and 0 interrupted iterations
ramp   [  95% ] 134/500 VUs  2m22.0s/2m30.0s

running (2m23.0s), 118/500 VUs, 2985345 complete and 0 interrupted iterations
ramp   [  95% ] 118/500 VUs  2m23.0s/2m30.0s

running (2m24.0s), 101/500 VUs, 3003020 complete and 0 interrupted iterations
ramp   [  96% ] 101/500 VUs  2m24.0s/2m30.0s

running (2m25.0s), 084/500 VUs, 3020308 complete and 0 interrupted iterations
ramp   [  97% ] 084/500 VUs  2m25.0s/2m30.0s

running (2m26.0s), 068/500 VUs, 3037874 complete and 0 interrupted iterations
ramp   [  97% ] 068/500 VUs  2m26.0s/2m30.0s

running (2m27.0s), 051/500 VUs, 3054476 complete and 0 interrupted iterations
ramp   [  98% ] 051/500 VUs  2m27.0s/2m30.0s

running (2m28.0s), 034/500 VUs, 3069956 complete and 0 interrupted iterations
ramp   [  99% ] 034/500 VUs  2m28.0s/2m30.0s

running (2m29.0s), 018/500 VUs, 3085208 complete and 0 interrupted iterations
ramp   [  99% ] 018/500 VUs  2m29.0s/2m30.0s

running (2m30.0s), 001/500 VUs, 3096711 complete and 0 interrupted iterations
ramp   [ 100% ] 001/500 VUs  2m30.0s/2m30.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(99)<2000' p(99)=39.67ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6193544 41289.638204/s
    checks_succeeded...: 100.00% 6193544 out of 6193544
    checks_failed......: 0.00%   0 out of 6193544

    ✓ status is 2xx
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=13.51ms min=168µs max=99.06ms p(50)=12.75ms p(75)=19.63ms p(90)=25.24ms p(95)=29.42ms p(99)=39.67ms count=3096772
      { expected_response:true }...: avg=13.51ms min=168µs max=99.06ms p(50)=12.75ms p(75)=19.63ms p(90)=25.24ms p(95)=29.42ms p(99)=39.67ms count=3096772
    http_req_failed................: 0.00%   0 out of 3096772
    http_reqs......................: 3096772 20644.819102/s

    EXECUTION
    iteration_duration.............: avg=13.54ms min=189µs max=99.08ms p(50)=12.79ms p(75)=19.67ms p(90)=25.28ms p(95)=29.46ms p(99)=39.71ms count=3096772
    iterations.....................: 3096772 20644.819102/s
    vus............................: 1       min=1            max=500
    vus_max........................: 500     min=500          max=500

    NETWORK
    data_received..................: 1.1 GB  7.5 MB/s
    data_sent......................: 1.0 GB  6.8 MB/s



running (2m30.0s), 000/500 VUs, 3096772 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 000/500 VUs  2m30s